app/controllers/admin_users_controller.rb

  def show
    @user = AdminUser.find(1)
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = $1 LIMIT 1  [["id", nil]]