app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "subtitle", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Jeff"], ["subtitle", "Like vanilla"], ["content", "in his coffee"], ["created_at", "2016-03-07 16:15:34.581112"], ["updated_at", "2016-03-07 16:15:34.581112"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "THingsy"], ["updated_at", "2016-03-07 15:47:53.064828"], ["id", 1]]